LOG_DICT=dict()

LOG_DICT['开挖汇总']={
    '+管道名称': (1, 2), '+管道规格': (1, 4), '+检测日期': (1, 6), '+探坑编号': (2, 2), '+探坑位置': (2, 4), '+探坑规格': (2, 6), 
    '+地表状况': (3, 2), '+环境条件': (3, 4), '+检验情况：': (4, 1), '+检验结论：': (5, 1), 
    }

LOG_DICT['开挖第一页']={
    '+管道名称': (1, 2), '+管道规格': (1, 4), '+检测管段': (1, 6), '+探坑编号': (2, 2), '+探坑规格': (2, 4), '+管道埋深': (2, 6),
    '+天气条件': (3, 2), '+近参比电位': (3, 4), '+防腐层类型': (3, 6), '+地下水': (4, 3), '+地形、地貌、地物描述': (5, 3), 
    '+植物根系': (6, 3), '+土壤颜色': (6, 5), '+土壤松紧度': (7, 3), '+土壤颗粒组划分': (8, 3), '+土壤分层描述': (9, 3), 
    '+土壤干湿度': (10, 3), '颜色、光泽变化情况：+外观': (11, 3), '+结构': (13, 3), '+粘附力': (13, 5), 
    }

LOG_DICT['开挖第二页']={
    '+管道名称': (1, 2), '+管道规格': (1, 4), '+检测日期': (1, 6), '+探坑位置': (2, 2), '+探坑编号': (2, 4), '+环境条件': (2, 6), 
    '+防腐层破损情况描述': (4, 3), '+防腐层测厚设备名称及编号': (5, 4), '+FC1L0': (6, 5), '+FC1L3': (6, 7), '+FC1L6': (6, 9), '+FC1L9': (6, 11), 
    '+管道本体腐蚀情况描述': (10, 3), '+管子测厚用设备及编号': (11, 4), '+C1L0': (12, 5), '+C1L3': (12, 7), '+C1L6': (12, 9), '+C1L9': (12, 11), 
    }

LOG_DICT['开挖勾选']={
    '地下水':['有','无','时有时无'],
    # '地形、地貌、地物描述':['','',],
    '植物根系':['茂盛','中等','无或很少'],
    '土壤松紧度':['疏松','松','稍紧','紧','很紧'],
    '土壤颗粒组划分':['粘粒组','粉粒组','砂粒组','砾石组','卵石组','块石'],
    '土壤干湿度':['干','润','潮','湿','水'],
    '外观':['无','有','出现麻面及鼓泡、裂纹等'],
    '粘附力':['无变化','减少','剥落'],

}