LOG_DICT = dict()
"""常量的索引"""
LOG_DICT['开挖检测记录'] = [
    # ('+记录编号' , '记录自编号'),
    # ('+管道名称' , '管道名称'),
    # ('+管道编号' , '管道编号'),
    ('+管道规格' , '管道规格'),
    ('+管道埋深' , '管道埋深（m）'),
    # ('+探坑编号' , '探坑编号'),
    ('+探坑规格' , '探坑规格（m）'),
    ('+检测仪器' , '检测仪器'),
    ('+仪器编号' , '仪器编号'), 
    ('+缺陷描述' , '缺陷描述'),
    # ('+备注' , '备注'),
    # ('+探坑位置','探坑位置'),
    # ('+其他地形、地貌','其他地形、地貌'),
    # ('+热熔连接缺陷描述','热熔连接缺陷描述'),
    # ('+电熔连接缺陷描述','电熔连接缺陷描述'),
    # ('+法兰连接缺陷描述','法兰连接缺陷描述'),
    # ('+钢塑转换缺陷描述','钢塑转换缺陷描述'),
    # ('+检验日期','检验日期')
      
]

LOG_DICT['开挖检测记录选项'] = {
    '警示带' :('有','无'),
    '地下水':('有','无','时有时无'),
    '地形、地貌、地物描述':('机动车道','非机动车道（含人行道）','机动车不可能到达的地方','水田','河道边','绿化带','其他：'),
    '植物根系':('茂盛','中等','无或很少'),  
    '土壤松紧度':('疏松','松','稍紧','紧','很紧'),  
    '土壤粒组划分':( '粘粒组','粉粒组','砂粒组','砾石组','卵（碎）石组','块石组'), 
    '土壤分层描述':('岩石','碎石土','砂土','粉土','黏性土'),  
    '土壤干湿度':('干','润','潮','湿','水'), 
    '管道本体缺陷':('无','槽痕','凿痕','凹痕','老化降解','其他'),  
    '热熔连接':('完好','无此项','缺陷：'),
    '电熔连接':('完好','无此项','缺陷：'),
    '法兰连接':('完好','无此项','缺陷：'),
    '钢塑转换接头':('完好','无此项','缺陷：'),
 
}


LOG_DICT['宏观检查记录'] = [
    ('+记录编号' , '记录自编号'),
    ('+管道名称' , '管道名称'),
    ('+管道编号' , '管道编号'),
    ('+环境条件' , '环境条件'),
    ('+设备名称型号' , '设备名称型号'),
    ('+管段' , '管段（桩号）'),
    ('+设备编号' , '设备编号')   
]


LOG_DICT['宏观检查记录填表'] = [
    ('&项目类别','检查项目类别'),
    ('&X','坐标X'),
    ('&Y','坐标Y'),
    ('&地标、位置','地表参照及位置描述'),
    ('&检查结果','检查结果')
]
LOG_DICT['宏观检查记录填表记数'] = 15

LOG_DICT['穿、跨越检查记录'] =[
    ('+记录编号','记录自编号'),
    ('+管道名称','  管道名称'),
    ('+管道编号','管道编号'),
    ('+管道规格','管道规格'),
    ('+管段','管段（桩号）'),
    ('+管道长度','管道长度（km）'),
    ('+环境条件','环境条件'),
 ]

LOG_DICT['穿、跨越检查记录填表1'] =[
     ('&长度','跨越长度（m）'),
    ('&发现问题及位置描述','发现问题及位置描述（跨越）'),
    ('&备注','备注（跨越）'),
]
LOG_DICT['穿、跨越检查记录填表1记数'] = 8

LOG_DICT['穿、跨越检查记录填表2'] =[
     ('&长度','穿越长度（m）'),
    ('&发现问题及位置描述','发现问题及位置描述（穿越）'),
    ('&备注','备注（穿越）'),
]
LOG_DICT['穿、跨越检查记录填表2记数'] = 10

LOG_DICT['宏观检查报告']= {
    '位置与走向':('符合','不符合'),
    '地面标志':('完好','标志错误','标志不清','损坏','丢失','无标志'),
    '管道防护带':('违章建筑','第三方施工','深根植物','无此项'),
    '穿、跨越公路':('保护设施完好','无保护措施','锚固墩损坏','检查孔破损','稳管措施损坏','无此项'),
    '穿、跨越河流':('保护设施完好','无保护措施','浮管','露管','无此项'),
    '地表环境':('合格','净距超标','管道占压','管道裸露','土壤扰动'),
    '阀门':('合格','腐蚀','裂纹','护管内积水','缩孔','连接螺栓松动','操作不灵活','泄漏','无此项'),  
    '阀门井':('合格','井盖破损','井盖打不开','井内积水','无示踪球','无此项'),  
    # '钢塑转换接头':('完好','腐蚀','裂纹','无此项') ,
    '调压箱、调压柜':('完好','腐蚀','泄漏','不符合规范','无此项') ,
}

LOG_DICT['宏观检查报告索引']={
    '+管道名称': (1, 2), '+管道编号':(1,4),'+管段': (2, 2), '+环境': (2, 4),'+设备名称型号': (3, 2), '+设备编号': (3, 4), '+位置与走向': (6, 3), 
    '+地面标志': (7, 3), '+管道防护带': (8, 3), '+穿、跨越公路': (10, 3), '+穿、跨越河流': (11, 3), '+地表环境': (12, 3), '+阀门':(14,3),
    '+阀门井': (15, 3), '+钢塑转换接头':(17,3),'+调压箱、调压柜':(18,3),'+结论': (21, 1), '+检验日期': (22, 2)
                            }

LOG_DICT['开挖报告首页索引']={
    '+管道名称': (1, 2), '+管道规格': (1, 4), '+实际检验日期': (1, 6), '+探坑编号': (2, 2), '+探坑位置': (2, 4), '+探坑规格': (2, 6), 
    '+地表状况': (3, 2), '+环境条件': (3, 4), '+检验情况': (4, 1), '+检验结论': (5, 1),'+检验日期': (6, 2)
    }

LOG_DICT['开挖检测报告索引']={
    '+管道名称': (1, 2), '+管道编号': (1, 4), '+管道规格': (2, 2), '+管道埋深': (2, 4), '+探坑编号': (3, 2),
    '+探坑规格': (3, 4), '+检测仪器': (4, 2), '+仪器编号': (4, 4), '+警示带': (5, 3), '+地下水': (6, 3), '+地形、地貌、地物描述': (7, 3), 
    '+植物根系': (8, 3), '+土壤松紧度': (9, 3), '+土壤粒组划分': (10, 3), '+土壤分层描述': (11, 3), '+土壤干湿度': (12, 3), '+管道本体缺陷': (13, 3), 
    '+缺陷描述': (15, 4), '+热熔连接': (16, 3), '+电熔连接': (17, 3), '+法兰连接': (18, 3), '+钢塑转换接头': (19, 3),
    '+备注': (20, 1), '+检验日期': (21, 2)
}

LOG_DICT['穿、跨越报告索引']={
    '+管道名称': (1, 2), '+管道编号':(1,4),'+管段': (2, 2), '+环境条件':(2,6),'&号1': (5, 1), '&长度1': (5, 2), '&发现问题及位置描述1': (5, 3), '&备注1': (5, 4), 
    '&号2': (6, 1), '&长度2': (6, 2), '&发现问题及位置描述2': (6, 3), '&备注2': (6, 4), '&号3': (7, 1), '&长度3': (7, 2), '&发现问题及位置描述3': (7, 3), 
    '&备注3': (7, 4), '&号4': (8, 1), '&长度4': (8, 2), '&发现问题及位置描述4': (8, 3), '&备注4': (8, 4), '&号5': (9, 1), '&长度5': (9, 2), 
    '&发现问题及位置描述5': (9, 3), '&备注5': (9, 4), '$号1': (12, 1), '$长度1': (12, 2), '$发现问题及位置描述1': (12, 3), '$备注1': (12, 4), 
    '$号2': (13, 1), '$长度2': (13, 2), '$发现问题及位置描述2': (13, 3), '$备注2': (13, 4), '$号3': (14, 1), '$长度3': (14, 2), '$发现问题及位置描述3': (14, 3), 
    '$备注3': (14, 4), '$号4': (15, 1), '$长度4': (15, 2), '$发现问题及位置描述4': (15, 3), '$备注4': (15, 4), '$号5': (16, 1), '$长度5': (16, 2), 
    '$发现问题及位置描述5': (16, 3), '$备注5': (16, 4), '$号6': (17, 1), '$长度6': (17, 2), '$发现问题及位置描述6': (17, 3), '$备注6': (17, 4), '$号7': (18, 1), 
    '$长度7': (18, 2), '$发现问题及位置描述7': (18, 3), '$备注7': (18, 4), '$号8': (19, 1), '$长度8': (19, 2), '$发现问题及位置描述8': (19, 3), 
    '$备注8': (19, 4), '$号9': (20, 1), '$长度9': (20, 2), '$发现问题及位置描述9': (20, 3), '$备注9': (20, 4), '+检查结论': (21, 1), '+检验日期': (22, 2)
}

LOG_DICT['宏观检查记录生成']={
    '+管道名称': (1, 2), '+管道编号': (1, 4), '+管段': (2, 2), 
    '+环境条件': (2, 4), '+设备名称型号': (3, 2), '+设备编号': (3, 4), 
    '&号1': (6, 1), '&项目类别1': (6, 2), '&坐标1': (6, 3), '&地标、位置1': (6, 4), '&检查结果1': (6, 5), 
    '&号2': (7, 1), '&项目类别2': (7, 2), '&坐标2': (7, 3), '&地标、位置2': (7, 4), '&检查结果2': (7, 5), 
    '&号3': (8, 1), '&项目类别3': (8, 2), '&坐标3': (8, 3), '&地标、位置3': (8, 4), '&检查结果3': (8, 5), 
    '&号4': (9, 1), '&项目类别4': (9, 2), '&坐标4': (9, 3), '&地标、位置4': (9, 4), '&检查结果4': (9, 5), 
    '&号5': (10, 1), '&项目类别5': (10, 2), '&坐标5': (10, 3), '&地标、位置5': (10, 4), '&检查结果5': (10, 5), 
    '&号6': (11, 1), '&项目类别6': (11, 2), '&坐标6': (11, 3), '&地标、位置6': (11, 4), '&检查结果6': (11, 5), 
    '&号7': (12, 1), '&项目类别7': (12, 2), '&坐标7': (12, 3), '&地标、位置7': (12, 4), '&检查结果7': (12, 5), 
    '&号8': (13, 1), '&项目类别8': (13, 2), '&坐标8': (13, 3), '&地标、位置8': (13, 4), '&检查结果8': (13, 5), 
    '&号9': (14, 1), '&项目类别9': (14, 2), '&坐标9': (14, 3), '&地标、位置9': (14, 4), '&检查结果9': (14, 5),
    '&号10': (15, 1), '&项目类别10': (15, 2), '&坐标10': (15, 3), '&地标、位置10': (15, 4), '&检查结果10': (15, 5), 
    '&号11': (16, 1), '&项目类别11': (16, 2), '&坐标11': (16, 3), '&地标、位置11': (16, 4), '&检查结果11': (16, 5), 
    '&号12': (17, 1), '&项目类别12': (17, 2), '&坐标12': (17, 3), '&地标、位置12': (17, 4), '&检查结果12': (17, 5), 
    '&号13': (18, 1), '&项目类别13': (18, 2), '&坐标13': (18, 3), '&地标、位置13': (18, 4), '&检查结果13': (18, 5), 
    '&号0': (19, 1), '&项目类别0': (19, 2), '&坐标0': (19, 3), '&地标、位置0': (19, 4), '&检查结果0': (19, 5), 
    '+检验日期': (20, 2)}

LOG_DICT['开挖检测记录生成']={
    '+管道名称': (1, 2), '+管道编号': (1, 4), '+管道规格': (2, 2), '+管道埋深': (2, 4), 
    '+探坑编号': (3, 2), '+探坑规格': (3, 4), '+检测仪器': (4, 2), '+仪器编号': (4, 4), '+警示带': (5, 3), 
    '+地下水': (6, 3), '+地形、地貌、地物描述': (7, 3), '+植物根系': (8, 3), '+土壤松紧度': (9, 3), 
    '+土壤粒组划分': (10, 3), '+土壤分层描述': (11, 3), '+土壤干湿度': (12, 3), '+管道本体缺陷': (13, 3), 
    '+缺陷描述': (15, 4), '+热熔连接': (16, 3), '+电熔连接': (17, 3), 
    '+法兰连接': (18, 3), '+钢塑转换接头': (19, 3), '+备注': (20, 1), '+检验日期': (21, 2)
    }

LOG_DICT['穿、跨越检查记录生成']={
    '+管道名称': (1, 2), '+管道编号': (1, 4), '+管道规格': (1, 6), '+管段': (2, 2), '+管道长度': (2, 4), '+环境条件': (2, 6), 
    '&号1': (5, 1), '&长度1': (5, 2), '&发现问题及位置描述1': (5, 3), '&备注1': (5, 4), 
    '&号2': (6, 1), '&长度2': (6, 2), '&发现问题及位置描述2': (6, 3), '&备注2': (6, 4), 
    '&号3': (7, 1), '&长度3': (7, 2), '&发现问题及位置描述3': (7, 3), '&备注3': (7, 4), 
    '&号4': (8, 1), '&长度4': (8, 2), '&发现问题及位置描述4': (8, 3), '&备注4': (8, 4), 
    '&号5': (9, 1), '&长度5': (9, 2), '&发现问题及位置描述5': (9, 3), '&备注5': (9, 4), 
    '&号6': (10, 1), '&长度6': (10, 2), '&发现问题及位置描述6': (10, 3), '&备注6': (10, 4), 
    '&号7': (11, 1), '&长度7': (11, 2), '&发现问题及位置描述7': (11, 3), '&备注7': (11, 4), 
    '&号8': (12, 1), '&长度8': (12, 2), '&发现问题及位置描述8': (12, 3), '&备注8': (12, 4), 
    '$号1': (15, 1), '$长度1': (15, 2), '$发现问题及位置描述1': (15, 3), '$备注1': (15, 4),
    '$号2': (16, 1), '$长度2': (16, 2), '$发现问题及位置描述2': (16, 3), '$备注2': (16, 4), 
    '$号3': (17, 1), '$长度3': (17, 2), '$发现问题及位置描述3': (17, 3), '$备注3': (17, 4), 
    '$号4': (18, 1), '$长度4': (18, 2), '$发现问题及位置描述4': (18, 3), '$备注4': (18, 4), 
    '$号5': (19, 1), '$长度5': (19, 2), '$发现问题及位置描述5': (19, 3), '$备注5': (19, 4), 
    '$号6': (20, 1), '$长度6': (20, 2), '$发现问题及位置描述6': (20, 3), '$备注6': (20, 4), 
    '$号7': (21, 1), '$长度7': (21, 2), '$发现问题及位置描述7': (21, 3), '$备注7': (21, 4), 
    '$号8': (22, 1), '$长度8': (22, 2), '$发现问题及位置描述8': (22, 3), '$备注8': (22, 4), 
    '$号9': (23, 1), '$长度9': (23, 2), '$发现问题及位置描述9': (23, 3), '$备注9': (23, 4), 
    '$号10': (24, 1), '$长度10': (24, 2), '$发现问题及位置描述10': (24, 3), '$备注10': (24, 4),
    '+检验日期': (25, 2)
    }
LOG_DICT['资料审查记录生成']={
    # '+使用单位': (3, 2), '+单位地址': (4, 2), '+安全管理人员': (5, 2), '+联系电话': (5, 4),'+邮政编码': (6, 2), '+压力管道代码': (6, 4), 
      '+管段名称': (1, 2),'+起止位置': (2, 4),
      '+设计单位': (7, 2), '+长度': (7, 4), '+安装单位': (8, 2), '+施工及验收规范': (8, 4), '+设计规范': (9, 2), '+竣工验收日期': (9, 4), 
      '+设计压力': (10, 2), '+投用日期': (10, 4),'+设计温度': (11, 2), '+实际使用年限': (11, 4), '+管道规格': (12, 2), '+操作压力': (12, 4), '+操作温度': (13, 4), 
      '+管道材质': (14, 2), '+设计介质': (14, 4), '+安全管理资料审查': (18, 2), '+技术档案资料审查': (19, 2), '+运行状况资料审查': (20, 2), 
      '+资料审查问题记载': (21, 2), '+检验日期': (22, 2)
      }

LOG_DICT['风险评估打分表—失效可能性']={
    '管道名称': (2, 1), '记录编号': (2, 2), '&1': (5, 8), '&2': (6, 8), '&3': (7, 8), '&4': (8, 8),
    '&5': (9, 8), '&6': (10, 8), '&7': (11, 8), '&8': (12, 8), '&9': (13, 8), '&10': (14, 8), '&11': (15, 8), '&12': (16, 8),
    '&13': (17, 8), '&14': (20, 8), '&15': (25, 8), '&16': (26, 8), '+评估日期': (89, 2), '&17': (28, 8), '&18': (32, 8), 
    '&19': (33, 8), '&20': (34, 8),'&21': (35, 8), '&22': (36, 8), '&23': (37, 8), '&24': (38, 8), '&25': (39, 8), '&26': (40, 8), 
    '&27': (41, 8),'&28': (42, 8), '&29': (47, 8), '&30': (49, 8), '&31': (50, 8), '&32': (51, 8), '&33': (52, 8), '&34': (53, 8), 
    '&35': (54, 8), '&36': (55, 8), '&37': (56, 8), '&38': (57, 8), '&39': (58, 8), '&40': (59, 8), '&41': (60, 8), '&42': (61, 8), 
    '&43': (62, 8), '&44': (63, 8), '&45': (64, 8), '&46': (69, 8), '&47': (72, 8), '&48': (75, 8), '&49': (76, 8), '&50': (77, 8), 
    '&51': (80, 8),'&52': (81, 8), '&53': (82, 8), '&54': (85, 8), '&55': (86, 8), '&56': (87, 8), '&100': (88, 5)
    }

LOG_DICT['风险评估打分表—失效后果']={
    '管道名称': (2, 1),'记录编号': (2, 2), '&1': (4, 6), '&2': (5, 6), '&3': (8, 6), '&4': (11, 6), '&5': (16, 6), 
    '&6': (18, 6), '&7': (21, 6), '+评估日期': (54, 2), '&8': (28, 6), '&9': (34, 6), '&10': (37, 6), '&11': (42, 6), '&12': (49, 6),
    '&100': (53, 5)
    }

LOG_DICT['PE定期检验报告'] = [
    ('+使用单位','使用单位'),
    ('+设备类别','设备类别'),
    ('+设备品种','设备品种'),
    ('+设备名称','管道名称'),
    ('+使用登记证号','使用登记证号'),
    ('+压力管道代码','压力管道代码'),
    ('+管道名称','管道名称'),
    ('+登记代码','登记代码'),
    ('+检验类别','检验类别'),
    ('+检验日期','检验日期')
]

LOG_DICT['老化评估结论表']={
    '对象简述': (2, 2), '评估情况表+介质类型': (4, 2), '长度m': (4, 4), '管材类别': (5, 2), 
    '使用单位': (8, 2), '$符合安全运行要求': (12, 2), '$落实安全管控措施，可继续运行': (12, 3), '$限期改造': (13, 2), 
    '$立即改造': (13, 3), '$材质落后': (14, 2), '$使用年限较长': (14, 3), '$腐蚀泄漏严重': (15, 2), '$防腐状况较差': (15, 3), 
    '$建构筑物占压': (16, 2), '$处于/临近地质灾害易发区域': (16, 3), '$处于/临近人员密集区': (17, 2), '$其他主要问题：': (17, 3)
    }

LOG_DICT['老化评估-资料审查报告']={
    '管道名称': (1, 2), '管道类别': (1, 4), '管道地址': (2, 2), '管道长度（m）': (2, 4), 
    '设计单位': (3, 2), '监理单位': (3, 4), '安装单位': (4, 2), '施工及验收规范': (4, 4), 
    '设计规范': (5, 2), '竣工验收日期': (5, 4), '设计压力': (6, 2), '投用日期': (6, 4),
    '设计温度': (7, 2), '实际使用年限': (7, 4), '管道规格': (8, 2), '操作压力': (8, 4), 
    '腐蚀裕量': (9, 2), '设计介质': (9, 4), '管道材质': (10, 2), '防腐层材料': (10, 4), 
    '资料审查+安全管理资料审查': (11, 2), '资料审查+技术档案资料审查': (12, 2), '资料审查+运行状况资料审查': (13, 2), '资料审查+资料审查问题记载': (14, 2)
    }

LOG_DICT['老化评估-宏观检查报告']={
    '管道名称': (1, 2), '管道地址': (2, 2), '管道规格': (2, 4), '+漆色标志': (4, 3), 
    '多重立管检查+管道组成件': (5, 3), '多重立管检查+外表面': (6, 3), '多重立管检查+异常振动摩擦': (7, 3), 
    '多重立管检查+支吊架': (8, 3), '多重立管检查+阀门': (9, 3), '多重立管检查+法兰': (10, 3), '+包裹占压': (11, 3), 
    '多重立管检查+其他检查': (12, 3), '+结论': (13, 1)
    }

LOG_DICT['老化评估-泄漏评估报告']={
    '管道名称': (1, 2), '管道材质': (1, 4), '管道地址': (2, 2), 
    '管道规格': (2, 4), '++检测点位置': (11, 2), 
    '++检测时间': (11, 3), '++浓度': (11, 4), '评估结果：多重泄漏评估+检测结果': (12, 1)
    }

LOG_DICT['重庆评估-明设评估报告']={
    '+评估单元': (1, 3), '+总栋数': (1, 5), '+总根数': (3, 3), '+总户数': (3, 5), '户内立管主要问题：+主要问题': (6, 3), 
    '户内立管：+立即改造X栋；纳入改造计划X栋。': (7, 3), '+更新改造范围、更新改造方式等': (8, 3)
    }

LOG_DICT['重庆评估-楼栋记录']={
    '楼栋地址：+楼栋名称': (1, 1), '总户数：+楼栋户数': (1, 2), '合计：+4级户数户': (8, 2), '合计：+3级户数户': (11, 2),
      '$立即改造': (12, 2), '$纳入改造计划': (12, 3), '$按巡检要求持续检查和运维': (13, 2)
      }

LOG_DICT['重庆评估-资料审查报告填表']=[
    '管道名称','设计单位','投用日期','安装单位','设计规范','工作介质','验收规范','设计压力','管道长度','设计温度','操作压力','管道材质','操作温度',
    '管道规格','防腐层材料','原始资料及记录审查问题记载',
]
   

LOG_DICT['重庆评估-资料审查报告勾选']={
    '设计资料':('齐全','部分缺失','无资料'),
    '施工、竣工验收资料':('齐全','部分缺失','无资料'),
    '安全管理制度与安全操作规程':('有','无'),
    '日常运行维护记录':('齐全','部分缺失','无资料'),
    '隐患排查治理记录':('齐全','部分缺失','无资料'),
    '修理改造资料':('齐全','部分缺失','无资料','无此项'),
    '故障与事故记录':('齐全','部分缺失','无资料','无此项'),
}

LOG_DICT['重庆评估-资料审查报告索引']={
    '管道名称': (1, 2), '设计单位': (2, 2), '投用日期': (2, 4), '安装单位': (3, 2), '设计规范': (3, 4), '工作介质': (4, 2), '验收规范': (4, 4), 
    '设计压力': (5, 2), '管道长度': (5, 4), '设计温度': (6, 2), '操作压力': (6, 4), '管道材质': (7, 2), '操作温度': (7, 4), '管道规格': (8, 2),
    '防腐层材料': (8, 4), '设计资料': (9, 3), '施工、竣工验收资料': (10, 3), '安全管理制度与安全操作规程': (11, 3), '日常运行维护记录': (12, 3), 
    '隐患排查治理记录': (13, 3), '修理改造资料': (14, 3), '故障与事故记录': (15, 3), '原始资料及记录审查问题记载': (16, 2), '历史检查问题记载': (17, 2)
    }

LOG_DICT['重庆评估-现场检查报告填表']=[
    '管道名称','检测日期',
]

LOG_DICT['重庆评估-现场检查报告勾选']={
    '位置与走向':('符合','不符合'),
    '可见部位防腐层':('完好','破损','无异常（位置：短桩、调压箱）'),
    '占压、圈围':('占压','圈围','无异常'),
    '管道周围':('管道铺设于绿化带','穿越硬化面'),
    '与建构筑物或相邻管道的净距':('净距不足','无异常'),
    '穿跨越':('无异常','损坏','无此项'),
    '标志桩（砖）':('无异常','缺失、损坏'),
    '露管情况':('有','无'),
    '钢质焊口质量':('工艺记录','焊缝探伤报告','无此项'),
    'PE管道焊口质量':('电熔连接对接接头质量检验报告','无此项'),
    '壁厚（GB55009）':('符合','不符合','无此项'),
    '防腐类型':('3PE','沥青玻璃布','沥青冷缠带','无防护'),
    '使用年限':('＜20年','20-30年','＞30年'),
    '杂散电流':('＞350mV','50~350mV','＜50mV'),
    '地质灾害':('滑坡','泥石流','地震','洪水','严重沉降','水保失效','无以上情况'),
    '深根植被':('大量','少量','无'),
    '阴极保护':('有效','失效','无'),
    '泄漏检测':('有泄漏','无泄漏'),
    
}

LOG_DICT['重庆评估-现场检查报告索引']={
    '管道名称': (1, 2), '检测日期': (1, 4), '位置与走向': (2, 2), '可见部位防腐层': (3, 2), '占压、圈围': (4, 3), '管道周围': (5, 3),
    '与建构筑物或相邻管道的净距': (6, 3), '管道埋深': (7, 3), '穿跨越': (8, 3), '标志桩（砖）': (9, 3), '露管情况': (10, 3), 
    '钢质焊口质量': (11, 3), 'PE管道焊口质量': (12, 3), '壁厚（GB55009）': (13, 3), '防腐类型': (14, 3), '使用年限': (15, 3), '杂散电流':(16,3),
    '地质灾害': (17, 3), '深根植被': (18, 3), '阴极保护': (19, 3), '泄漏检测': (20, 3),  '问题与结论': (21, 2)
    }
LOG_DICT['重庆评估-失效可能性评分']={
    '管道名称': (1, 1), '占压': (3, 7), '圈围': (4, 7), '与建构筑物或相邻管道的净距': (5, 7), '管道埋深': (6, 7), '穿越': (7, 8), '跨越': (8, 8), 
    '警示标识': (9, 7), '接口质量（焊接、熔接）': (10, 7), '壁厚': (11, 7), '防腐类型': (12, 7), '使用年限': (13, 7), '阴极保护': (14, 7), '泄漏检测': (15, 7), 
    '泄漏抢险频次': (16, 7),'电流衰减率': (17, 8),'破损点': (18, 8), '杂散电流': (19, 7), '地质灾害': (20, 7), '深根植被': (21, 7), '+可能性总分': (22, 5)
    }

LOG_DICT['重庆评估-失效后果评分']={
    '管道名称': (1, 1), '最高工作压力': (3, 6), '周边环境': (10, 6), '人口密度': (13, 6), '财产密度': (18, 6), '泄漏原因': (24, 6), 
    '抢修时间/天': (26, 6), '供应中断的影响范围和程度': (31, 6), '后果总分': (36, 5)
    }

RISKY_EVA_S_CQ:dict[str,dict[str,list[tuple[tuple|str,int]]]] = dict()
RISKY_EVA_S_CQ['隐患情况']={
    '占压':[((3,100),12.2),((0.01,3),6.1),((-100,0.01),0)],
    '圈围':[('有',2.4),('无',0)],
    '与建构筑物或相邻管道的净距':[((3,100),2.4),((0.01,3),1.2),((-100,0.01),0)],
}

RISKY_EVA_S_CQ['管道敷设情况']={
    '管道埋深':[('符合',0),('不符合',3.2)],
    '穿越':[('有密闭空间',2),('无密闭空间',0)],
    '跨越':[('有跨越',0.9),('无跨越',0)],
    '警示标识':[('有',0),('无或缺失',0.9)],
}
RISKY_EVA_S_CQ['管道及附属设施本体情况']={
    '接口质量（焊接、熔接）':[('无资料',15.8),('有部分资料',5)],
    '壁厚':[('符合',0),('不符合',6)],
    '防腐类型':[('无防护',10),('防锈油漆',8.5),('高密度聚乙烯',7),('沥青玻璃布',5.5),('煤焦油瓷漆、环氧煤沥青',3),('3PE',0)],
    '使用年限':[('<20年',0),('20-30年',1.4),('＞30年',2.7)],
}
RISKY_EVA_S_CQ['管道运维情况']={
    '阴极保护':[('无',2.6),('部分失效',1.3),('有效',0)],
    '泄漏检测':[('无泄漏',0),('有泄漏',5.7)],
    '泄漏抢险频次':[('1次',6.5),('2次',13),('3次',19.5)],
    '电流衰减率':[('二级',3.9)],
    '破损点':[('二级',3.9)],
}
RISKY_EVA_S_CQ['管道敷设外部环境']={
    '杂散电流':[((350,9999),2.3),((50,350),1.2),((-0.01,50),0)],
    '地质灾害':[('存在',3.4),('不存在',0)],
    '深根植被':[('大量',0.7),('少量',0.35),('无',0)],
}

RISKY_EVA_S:dict[str,dict[str,list[tuple[tuple|str,int]]]] = dict()


RISKY_EVA_S['资料审查'] = {
    '有无使用登记证':[('有',0),('无',2)],
    '有无安全管理规章制度与安全操作规则':[('有',0),('无',2)],
    '作业人员是否持证上岗':[('是',0),('否',1)],
    '有无定期检验报告':[('有',0),('无',1)],
    '有无设计文件资料':[('有',0),('无',1)],
    '日常运行及维修维护资料齐全、无或欠缺':[('齐全',0),('无或欠缺',1)]
}

RISKY_EVA_S['宏观检查'] ={
    '管道位置与走向是否清晰':[('是',0),('否',2)],
    '地面标志齐全、无或欠缺':[('齐全',0),('无或欠缺',2)],
    '是否存在地面滑坡、沉降、洪涝水毁等造成管道裸露或变形':[('是',1),('否',0)],
    '阀门、法兰、钢塑转换接头等管道元件是否完好':[('是',0),('否',1)],
    '穿越管道符合要求或存在隐患':[('符合要求',0),('存在隐患',2)],
    '是否定期排放积水以及护盖、排水装置是否完好':[('是',0),('否',1)],
    '管道埋深':[((-100,0.4),4),((0.4,1),2),((1,100),1)],
    '地面泄漏检查':[('一级泄漏',4),('二级泄漏',3),('三级泄漏',2),('四级泄漏',1),('无泄漏',0)],
    '安全保护装置是否完好':[('是',0),('否',2)],
    '地面保护装置是否完好':[('是',0),('否',1)],
    
}

RISKY_EVA_S['敷设环境调查']={
    '地面活动频繁程度':[('铁路或公路主干道',4),('普通公路',3),('人行路',2),('绿化带、小区',1),],
    '是否存在管道裸露情况':[('是',2),('否',0)],
    '与构筑物或相邻管道的净距是否符合要求':[('是',0),('否',2)],
    '管道上方是否有第三方施工活动':[('有',2),('无',0)],
    '是否经过不良地质条件':[('是',2),('否',0)],
    
}

RISKY_EVA_S['管道示踪系统完整性检查']={
    '示踪系统完整有效、无或部分缺失':[('完整有效',0),('无或部分缺失',4)],
}

RISKY_EVA_S['直接检验']={
    '是否存在生物损坏情况':[('是',1),('否',0)],
    '是否存在深根植物破坏情况':[('是',1),('否',0)],
    '管道表面有无鼓胀、气泡、槽痕或凹痕等缺陷':[('有',1),('无',0)],
    '管道有无老化降解、表面粉化等迹象':[('有',2),('无',0)],
    '示踪线（带）、警示带、管道的敷设质量是否符合要求':[('是',0),('否',2)],
    '管道地下敷设环境温度':[((-100,-20),3),((-20,0),2),((0,30),0),((30,40),2),((40,100),3)],
    '开挖检验时是否进行了焊接接头无损检测':[('是',0),('否',2)],
}

RISKY_EVA_S['安装及验收']={
    '安装单位有无资质':[('有',0),('无',2)],
    '管道元件制造单位有无资质':[('有',0),('无',2)],
    '管道元件有无质量证明文件':[('有',0),('无',1)],
    '管道元件有无进货检验':[('有',0),('无',1)],
    '焊接操作人员有无资质':[('有',0),('无',1)],
    '有无焊接工艺评定':[('有',0),('无',1)],
    '是否进行了焊接质量检验':[('是',0),('否',1)],
    '强度试验合格、无或不合格':[('合格',0),('无或不合格',2)],
    '严密性试验合格、无或不合格':[('有',0),('无',2)],
    '监理单位及人员有无资质':[('有',0),('无',1)],
    '监理结论是否合格':[('是',0),('否',1)],
    '监检单位及人员有无资质':[('有',0),('无',1)],
    '监检结论是否合格':[('是',0),('否',1)],
    '竣工资料齐全、无或不齐全':[('齐全',0),('无或不齐全',2)],
    '有无验收报告':[('有',0),('无',1)],
}

RISKY_EVA_S['使用年限']={
    '管道使用年限':[((0,10),2),((10,30),4),((30,50),6),]
}

RISKY_EVA_S['安全管理']={
    '巡线频率':[('周期性',0),('不定期',1),('不巡线',3)],
    '巡线方式':[('延线徒步',0),('只巡检建设挖掘频繁的管段',1),('不巡线',2)],
    '巡线人员的能力是否能够胜任':[('是',0),('否',1)],
    '公众教育':[('有资料且经常组织宣传管道安全知识',0),('有资料但较少组织宣传管道安全知识',1),('没有宣传资料、不组织宣传',2)],
    '有无安全机构和人员':[('有',0),('无',1)],
    '是否落实到人':[('是',0),('否',1)],
    '年度检查和定期检验':[('按规范要求实施',0),('发现问题才实施',2),('不实施',3)],
    '有无维护保养计划':[('有',0),('无',1)],
    '是否定期维护保养及更换部件':[('是',0),('否',2)],
    '有无GIS，PIMS等信息管理系统':[('有',0),('无',2)],
}

RISKY_EVA_C_CQ:dict[str,list[tuple[tuple|str,int]]] = dict()
RISKY_EVA_C_CQ={
    '最高工作压力':[('2.5kPa',2)],
    '周边环境':[('泄漏后无燃烧、爆燃风险的',0),('管线安全控制范围内存在火源、易燃易爆物的',14.5),('管线安全控制范围内存在密闭空间，燃气泄漏后容易积聚的',29)],
    '人口密度':[((-1,1),0),((1,100),11.8),((100,300),23.6),((300,500),35.3),((500,1000),47.1)],
    '财产密度':[('荒无人烟',0),('农业生产区',2.9),('住宅、宾馆、娱乐休闲地',5.7),('商业区',8.6),('仓库、码头、车站',11.4),('工业生产、住宅区',14.3)],
    '泄漏原因':[('焊接质量、腐蚀穿孔',10.4),('自然灾害',5.2)],
    '抢修时间/天':[((-1,1),1.7),((1,2),3.4),((2,4),5.0),((4,7),6.7),((7,100),8.4),],
    '供应中断的影响范围和程度':[((0,10000),6.7)]
}
RISKY_EVA_C:dict[str,list[tuple[tuple|str,int]]] = dict()
RISKY_EVA_C={
    '介质燃烧性':[('是天然气、人工煤气、液化石油气',20)],
    '介质毒性':[('天然气',4),('人工煤气',10),('液化石油气',4)],
    '最高工作压力MPa':[((0,0.1),2),((0.1,0.4),4),((0.4,0.8),6)],
    '最大泄漏量m3':[((0,1),1),((1,10),8),((10,100),12),((100,500),16),((500,10000),20)],
    '泄漏处地形':[('闭塞',1),('开阔',6)],
    '泄漏处年平均风速':[('低',2),('中等',6),('高',9)],
    '泄漏处1.6km长度范围内，管道区段两侧各200m范围内，人口数量':[((-1,1),0),((1,100),6),((100,300),12),((300,500),16),((500,1000),20)],
    '泄漏处1.6km长度范围内，管道区段两侧各200m范围内，大多为':[('荒无人烟',0),('农业生产区',3),('住宅、宾馆、娱乐休闲地',6),('商业区',9),('仓库、码头、车站',12),('工业生产、住宅区',15)],
    '泄漏原因是':[('操作失误',1),('焊接质量',5),('第三方破坏或自然灾害',8)],
    '抢修时间/天':[((-1,1),1),((1,2),3),((2,4),5),((4,7),7),((7,100),9),],
    '供应中断的影响范围和程度':[('无重要用户，供应中断对其他单位影响一般',3),('影响小城市、小城镇的工业用燃料',6),('影响小企业、小城市生活',9),('影响一般的工业生产、中型城市生活',12),('影响国家重要大型企业、大型中心城市的生产、生活',15),],
    '用户对管道所输送介质的依赖性':[('供应中断的影响很小',3),('有代替介质可用',6),('有自备储存设施',9),('用户对管道所输送介质绝对依赖',12),]
}